In [14]:
import sqlite3

import numpy as np
import pandas as pd

In [15]:
df = pd.DataFrame({'Studentid': [1,2,3], 
                   'Name': ['Rodriguez', 'Pamela', 'Jackson'], 
                   'Degree':['graduate','undergraduate','graduate'], 
                   'Exams': ['exam7 (2017), exam9 (2018), exam3 (2018), exam7 (2017), exam5 (2020), exam10 (2019),exam1 (2016)',
                             'exam2 (2017), exam2 (2017), exam8 (2018), exam6 (2017), exam3 (2018), exam8 (2018),exam5 (2020), exam4 (2019), exam9 (2018)',
                             'exam7 (2017), exam6 (2017), exam2 (2017), exam2 (2017)'], 
                   'Scores': ['61, 38, 85, 70, 44, 43, 68',
                              '66, 69, 85, 62, 92, 72, 44, 50, 23',
                              '68, 73, 62, 72']})

In [16]:
df

,Studentid,Name,Degree,Exams,Scores
0,1,Rodriguez,graduate,"exam7 (2017), exam9 (2018), exam3 (2018), exam...","61, 38, 85, 70, 44, 43, 68"
1,2,Pamela,undergraduate,"exam2 (2017), exam2 (2017), exam8 (2018), exam...","66, 69, 85, 62, 92, 72, 44, 50, 23"
2,3,Jackson,graduate,"exam7 (2017), exam6 (2017), exam2 (2017), exam...","68, 73, 62, 72"

In [77]:
s=set()
for i,row in df.iterrows():
    
    for j in row['Exams'].split(','):
        s.add(j)
print(s)

{'exam7 (2017)', ' exam4 (2019)', ' exam10 (2019)', ' exam6 (2017)', 'exam5 (2020)', ' exam7 (2017)', ' exam5 (2020)', 'exam1 (2016)', ' exam8 (2018)', 'exam2 (2017)', ' exam3 (2018)', ' exam2 (2017)', ' exam9 (2018)'}

In [107]:
s=set()
for i,row in df.iterrows():
    
    for j in row['Exams'].split(','):
        j= j.strip()
        s.add(j)
    
print(s)

{'exam7 (2017)', 'exam8 (2018)', 'exam4 (2019)', 'exam9 (2018)', 'exam3 (2018)', 'exam5 (2020)', 'exam10 (2019)', 'exam1 (2016)', 'exam2 (2017)', 'exam6 (2017)'}

    Exams    Date
0   exam7  (2017)
1   exam8  (2018)
2   exam4  (2019)
3   exam9  (2018)
4   exam3  (2018)
5   exam5  (2020)
6  exam10  (2019)
7   exam1  (2016)
8   exam2  (2017)
9   exam6  (2017)

In [113]:
s=set()
for i,row in df.iterrows():
    
    for j in row['Exams'].split(','):
        j= j.strip()
        s.add(j)
    
df3 = pd.DataFrame({'Exams':list(s)})
df3 = df3.Exams.str.split(expand =True)
df3.columns =['Exams', 'Date']
df3.Date = df3.Date.str.strip(to_strip = "()")
df3

    Exams  Date
0   exam7  2017
1   exam8  2018
2   exam4  2019
3   exam9  2018
4   exam3  2018
5   exam5  2020
6  exam10  2019
7   exam1  2016
8   exam2  2017
9   exam6  2017

In [116]:
df3.dtypes

Exams    object
Date     object
dtype: object

In [129]:
s=set()
for i,row in df.iterrows():
    
    for j in row['Exams'].split(','):
        j= j.strip()
        s.add(j)
    
df3 = pd.DataFrame({'Exams':list(s)})
df3 = df3.Exams.str.split(expand =True)
df3.columns =['Exams', 'Date']
df3.Date = df3.Date.str.strip(to_strip = "()")
df3.Date = df3.Date.astype('int32')
#df3 = df3.astype({'Exams':'int32'})
df3.sort_values('Exams', inplace = True)
df3

    Exams  Date
7   exam1  2016
6  exam10  2019
8   exam2  2017
4   exam3  2018
2   exam4  2019
5   exam5  2020
9   exam6  2017
0   exam7  2017
1   exam8  2018
3   exam9  2018

In [96]:
s=set()
for i,row in df.iterrows():
    
    #for j in row['Exams'].split(','):
        #j= j.strip()
        #s.add(j)
    stripped = list(map(str.strip, row['Exams'].split(','))).apply(s.update)
df.Exams.str.split(',')
    
print(s)

AttributeError: 'list' object has no attribute 'apply'

In [104]:
s=set()
df.Exams.str.split(',').apply(s.update)  #used like a lambda 
print(s)
str(s).str.strip

{'exam7 (2017)', ' exam4 (2019)', ' exam10 (2019)', ' exam6 (2017)', 'exam5 (2020)', ' exam7 (2017)', ' exam5 (2020)', 'exam1 (2016)', ' exam8 (2018)', 'exam2 (2017)', ' exam3 (2018)', ' exam2 (2017)', ' exam9 (2018)'}

In [105]:
df.Exams.str.split(',')[0](s.update)

0    [exam7 (2017),  exam9 (2018),  exam3 (2018),  ...
1    [exam2 (2017),  exam2 (2017),  exam8 (2018),  ...
2    [exam7 (2017),  exam6 (2017),  exam2 (2017),  ...
Name: Exams, dtype: object

In [106]:
df3 = pd.DataFrame({'Exams':list(s)})

     Exams    Date
0    exam7  (2017)
1    exam4  (2019)
2   exam10  (2019)
3    exam6  (2017)
4    exam5  (2020)
5    exam7  (2017)
6    exam5  (2020)
7    exam1  (2016)
8    exam8  (2018)
9    exam2  (2017)
10   exam3  (2018)
11   exam2  (2017)
12   exam9  (2018)

In [92]:
df3 = df3.Exams.str.split(expand =True)
df3.columns =['Exams', 'Date']
df3

     Exams    Date
0    exam7  (2017)
1    exam4  (2019)
2   exam10  (2019)
3    exam6  (2017)
4    exam5  (2020)
5    exam7  (2017)
6    exam5  (2020)
7    exam1  (2016)
8    exam8  (2018)
9    exam2  (2017)
10   exam3  (2018)
11   exam2  (2017)
12   exam9  (2018)

In [67]:
s.split()

AttributeError: 'set' object has no attribute 'split'

In [ ]:
exam7 (2017), exam9 (2018), exam3 (2018), exam7 (2017), exam5 (2020), exam10 (2019), exam1 (2016)

In [23]:
df['Exams'][0]

'exam7 (2017), exam9 (2018), exam3 (2018), exam7 (2017), exam5 (2020), exam10 (2019),exam1 (2016)'

In [30]:
df.rows

AttributeError: 'DataFrame' object has no attribute 'rows'

In [32]:
for row in df.iterrows():
    row['Exams'].split(',')

TypeError: tuple indices must be integers or slices, not str

In [36]:
df2

   index  c1   c2
0      0  10  100
1      1  11  110
2      2  12  120

In [42]:
df2 = pd.DataFrame({'c1': [10, 11, 12], 'c2': [100, 110, 120]})
df2 = df2.reset_index()  # make sure indexes pair with number of rows
df2

   c1   c2
0  10  100
1  11  110
2  12  120

In [ ]:
#QUE- 3

In [150]:
df = pd.DataFrame({'StudentID': [1,2,3], 
                   'Name': ['Rodriguez, Pamela', 'Jackson, Kristie', 'Curtis, George'], 
                   'Degree':['graduate','undergraduate','graduate']})
df

   StudentID               Name         Degree
0          1  Rodriguez, Pamela       graduate
1          2   Jackson, Kristie  undergraduate
2          3     Curtis, George       graduate

In [158]:
df4 = df.Name.str.split(',',expand =True)
df4.columns =['Second_Name', 'First_Name']
df4['StudentID'] = df['StudentID']
df4['Degree'] = df['Degree']
df4

  Second_Name First_Name  StudentID         Degree
0   Rodriguez     Pamela          1       graduate
1     Jackson    Kristie          2  undergraduate
2      Curtis     George          3       graduate

In [160]:
df4.Second_Name =df4.Second_Name.str.strip()
df4.First_Name =df4.First_Name.str.strip()

  Second_Name First_Name  StudentID         Degree
0   Rodriguez     Pamela          1       graduate
1     Jackson    Kristie          2  undergraduate
2      Curtis     George          3       graduate

In [ ]:
df4[''] = df['StudentID']
df4[0] ='First Name'

In [163]:
header1 = ['chrom', 'pos', 'filter']
data1 = [4, 12345, 38.4]
header2 = ['chrom', 'pos', 'filter', 'qual']
data2 = ['3', 4899, 234, 89.9]

s1 = pd.Series(data1, header1)
s2 = pd.Series(data2, header2)
s1

chrom         4.0
pos       12345.0
filter       38.4
dtype: float64

In [165]:
## IMPORTANT - with index labels -- operations are based on label 
# adding in respet of indexes same index will get added irrespective of order of indexes
header1 = ['pos', 'filter', 'chrom']
data1 = [12345, 38.4, 4]
header2 = ['chrom', 'pos', 'filter', 'qual']
data2 = [3, 4899, 234, 89.9]

s1 = pd.Series(data1, header1)
s2 = pd.Series(data2, header2)

In [166]:
s1

pos       12345.0
filter       38.4
chrom         4.0
dtype: float64

In [167]:
s2

chrom        3.0
pos       4899.0
filter     234.0
qual        89.9
dtype: float64

In [168]:
s1+s2

chrom         7.0
filter      272.4
pos       17244.0
qual          NaN
dtype: float64

In [169]:
s1 = pd.Series(data1)
s2 = pd.Series(data2)

0    12345.0
1       38.4
2        4.0
dtype: float64

In [171]:
df

   StudentID               Name         Degree
0          1  Rodriguez, Pamela       graduate
1          2   Jackson, Kristie  undergraduate
2          3     Curtis, George       graduate

In [192]:
df.iloc[0]

exam1    69
exam2    92
exam3    98
Name: student1, dtype: int32

In [ ]:
#Subset of dataframe

In [175]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, index=students, columns=header)

In [176]:
df

          exam1  exam2  exam3
student1     69     92     98
student2     80     98     83
student3     98     69     71
student4     75     82     79

In [182]:

df.loc[['student1', 'student2'],['exam1', 'exam3']]

          exam1  exam3
student1     69     98
student2     80     83

In [191]:
df.iloc['student1']

TypeError: Cannot index by location index with a non-integer key

In [193]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, index=students, columns=header)

df>=90

          exam1  exam2  exam3
student1   True  False   True
student2  False  False   True
student3  False  False  False
student4   True  False  False

In [194]:
df[df>=90]

          exam1  exam2  exam3
student1   95.0    NaN   94.0
student2    NaN    NaN   91.0
student3    NaN    NaN    NaN
student4   94.0    NaN    NaN

In [195]:
df

          exam1  exam2  exam3
student1     95     69     94
student2     88     76     91
student3     68     79     65
student4     94     73     87

In [196]:
df[df['exam1']>=85]

          exam1  exam2  exam3
student1     95     69     94
student2     88     76     91
student4     94     73     87

In [197]:
df[df['exam1']>=85]['exam3']

student1    94
student2    91
student4    87
Name: exam3, dtype: int32

In [198]:
df[df['exam1']>=85][['exam2', 'exam3']]

          exam2  exam3
student1     69     94
student2     76     91
student4     73     87

In [201]:
df[(df['exam1']>=85) & (df['exam2']<=85)]

          exam1  exam2  exam3
student1     95     69     94
student2     88     76     91
student4     94     73     87

In [202]:
df[(df['exam1']>=85) | (df['exam2']>=85)]

          exam1  exam2  exam3
student1     95     69     94
student2     88     76     91
student4     94     73     87

In [212]:
students = 'student1 student1 student1 student2 student2 student2 student3 student3 student3'
exams = 'exam1 exam2 exam3'.split()*3
classes = 'class1 class2'
students

'student1 student1 student1 student2 student2 student2 student3 student3 student3'

In [213]:
exams

['exam1',
 'exam2',
 'exam3',
 'exam1',
 'exam2',
 'exam3',
 'exam1',
 'exam2',
 'exam3']

In [233]:
index=zip(students.split(),exams)

In [234]:
index= pd.MultiIndex.from_tuples(index)
index

MultiIndex([('student1', 'exam1'),
            ('student1', 'exam2'),
            ('student1', 'exam3'),
            ('student2', 'exam1'),
            ('student2', 'exam2'),
            ('student2', 'exam3'),
            ('student3', 'exam1'),
            ('student3', 'exam2'),
            ('student3', 'exam3')],
           )

In [235]:
index = pd.MultiIndex.from_tuples(index),

In [250]:
df = pd.DataFrame(np.random.randint(65,90,18).reshape(9,2),index,classes.split())
df

                class1  class2
student1 exam1      66      84
         exam2      80      81
         exam3      82      82
student2 exam1      68      69
         exam2      69      79
         exam3      82      65
student3 exam1      80      67
         exam2      66      82
         exam3      81      89

In [251]:
df.loc['student1']

       class1  class2
exam1      66      84
exam2      80      81
exam3      82      82

In [260]:
df.loc['student1'].loc['exam1']

class1    66
class2    84
Name: exam1, dtype: int32

In [263]:
df.loc['student1'].loc['exam1']['class1']

66

In [264]:
df.loc['student1'].loc['exam1'].class1

66

In [265]:
df.index.names

FrozenList([None, None])

In [266]:
df.index.names = ['Students', 'Exams']
df

                class1  class2
Students Exams
student1 exam1      66      84
         exam2      80      81
         exam3      82      82
student2 exam1      68      69
         exam2      69      79
         exam3      82      65
student3 exam1      80      67
         exam2      66      82
         exam3      81      89

In [267]:
df.xs('student1')

       class1  class2
Exams
exam1      66      84
exam2      80      81
exam3      82      82

In [268]:
df.xs('exam1', level='Exams')

          class1  class2
Students
student1      66      84
student2      68      69
student3      80      67

In [269]:
departments = { 
    'DepartmentId': [1, 2, 3, 4],
    'DepartmentName': ['IT', 'Physics', 'Arts', 'Math'] 
}

df1 = pd.DataFrame(departments)

students = {
    'StudentId': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'StudentName': ['Michael', 'John', 'Jack', 'Sara', 'Sally', 'Jena', 'Nancy', 'Adam', 'Stevens', 'George'],
    'DepartmentId': [1, 1, 1, 2, 2, np.nan, 2, 3, 3, np.nan]
}

df2 = pd.DataFrame(students)

marks = {
    'MarkId': [1, 2, 3, 4, 5, 6, 7, 8],
    'StudentId': [1, 2, 3, 4, 5, 6, 7, 8], 
    'Mark': [18, 20, 16, 19, 14, 20, 20, 20]
}

df3 = pd.DataFrame(marks)

In [270]:
df1

   DepartmentId DepartmentName
0             1             IT
1             2        Physics
2             3           Arts
3             4           Math

In [271]:
df2

   StudentId StudentName  DepartmentId
0          1     Michael           1.0
1          2        John           1.0
2          3        Jack           1.0
3          4        Sara           2.0
4          5       Sally           2.0
5          6        Jena           NaN
6          7       Nancy           2.0
7          8        Adam           3.0
8          9     Stevens           3.0
9         10      George           NaN

In [272]:
df3

   MarkId  StudentId  Mark
0       1          1    18
1       2          2    20
2       3          3    16
3       4          4    19
4       5          5    14
5       6          6    20
6       7          7    20
7       8          8    20

In [273]:
pd.merge(df2, df1, how='inner', on='DepartmentId')

   StudentId StudentName  DepartmentId DepartmentName
0          1     Michael           1.0             IT
1          2        John           1.0             IT
2          3        Jack           1.0             IT
3          4        Sara           2.0        Physics
4          5       Sally           2.0        Physics
5          7       Nancy           2.0        Physics
6          8        Adam           3.0           Arts
7          9     Stevens           3.0           Arts

In [274]:
pd.merge(df1, df2, how='inner', on='DepartmentId')

   DepartmentId DepartmentName  StudentId StudentName
0             1             IT          1     Michael
1             1             IT          2        John
2             1             IT          3        Jack
3             2        Physics          4        Sara
4             2        Physics          5       Sally
5             2        Physics          7       Nancy
6             3           Arts          8        Adam
7             3           Arts          9     Stevens

In [275]:
pd.merge(df1, df2, how='outer', on='DepartmentId')

    DepartmentId DepartmentName  StudentId StudentName
0            1.0             IT        1.0     Michael
1            1.0             IT        2.0        John
2            1.0             IT        3.0        Jack
3            2.0        Physics        4.0        Sara
4            2.0        Physics        5.0       Sally
5            2.0        Physics        7.0       Nancy
6            3.0           Arts        8.0        Adam
7            3.0           Arts        9.0     Stevens
8            4.0           Math        NaN         NaN
9            NaN            NaN        6.0        Jena
10           NaN            NaN       10.0      George

In [277]:
df1

   DepartmentId DepartmentName
0             1             IT
1             2        Physics
2             3           Arts
3             4           Math

In [278]:
df2

   StudentId StudentName  DepartmentId
0          1     Michael           1.0
1          2        John           1.0
2          3        Jack           1.0
3          4        Sara           2.0
4          5       Sally           2.0
5          6        Jena           NaN
6          7       Nancy           2.0
7          8        Adam           3.0
8          9     Stevens           3.0
9         10      George           NaN

In [276]:
pd.merge(df2, df1, how='right', on='DepartmentId')

   StudentId StudentName  DepartmentId DepartmentName
0        1.0     Michael           1.0             IT
1        2.0        John           1.0             IT
2        3.0        Jack           1.0             IT
3        4.0        Sara           2.0        Physics
4        5.0       Sally           2.0        Physics
5        7.0       Nancy           2.0        Physics
6        8.0        Adam           3.0           Arts
7        9.0     Stevens           3.0           Arts
8        NaN         NaN           4.0           Math

In [288]:
d1 = {
    'C0': ['COR0', 'COR1', 'COR2'],
    'C1': ['C1R0', 'C1R1', 'C2R2'],
    'C2': ['C2R0', 'C2R1', 'C2R2'],
}

df1 = pd.DataFrame(d1)

d2 = {
    'C0': ['C0R3', 'C0R4', 'C0R5'],
    'C1': ['C1R3', 'C1R4', 'C1R5'],
    'C2': ['C2R3', 'C2R4', 'C2R5'],
}

df2 = pd.DataFrame(d2)

d3 = {
    'C0': ['C0R6', 'C0R7', 'C0R8'],
    'C1': ['C1R6', 'C1R7', 'C1R8'],
    'C2': ['C2R6', 'C2R7', 'C2R8'],
}

df3 = pd.DataFrame(d3)

In [280]:
d1

{'C0': ['COR0', 'COR1', 'COR2'],
 'C1': ['C1R0', 'C1R1', 'C2R2'],
 'C2': ['C2R0', 'C2R1', 'C2R2']}

In [289]:
d2

{'C0': ['C0R3', 'C0R4', 'C0R5'],
 'C1': ['C1R3', 'C1R4', 'C1R5'],
 'C2': ['C2R3', 'C2R4', 'C2R5']}

In [282]:
d3

{'C0': ['C0R6', 'C0R7', 'C0R8'],
 'C1': ['C1R6', 'C1R7', 'C1R8'],
 'C2': ['C2R6', 'C2R7', 'C2R8']}

In [283]:
pd.concat([df1,df2,df3])

     C0    C1    C2
0  COR0  C1R0  C2R0
1  COR1  C1R1  C2R1
2  COR2  C2R2  C2R2
0  C0R3  C1R3  C2R3
1  C0R4  C1R4  C2R4
2  C0R5  C1R5  C2R5
0  C0R6  C1R6  C2R6
1  C0R7  C1R7  C2R7
2  C0R8  C1R8  C2R8

In [285]:
my_dict = {'student1': [90, 84, np.nan], 'student2': [77, np.nan, np.nan], 'student3': [88, 65, 93]}
df = pd.DataFrame(my_dict)
df

   student1  student2  student3
0      90.0      77.0        88
1      84.0       NaN        65
2       NaN       NaN        93

In [292]:
my_dict = {
    'Exams': 'exam1 exam1 exam1'.split() + 'exam2 exam2 exam2'.split() + 'exam3 exam3 exam3'.split(),
    'Students': 'student1 student2 student3'.split()*3,   
    'Scores': np.random.randint(65,101,9)
}
df = pd.DataFrame(my_dict)
df

   Exams  Students  Scores
0  exam1  student1      95
1  exam1  student2      92
2  exam1  student3     100
3  exam2  student1      68
4  exam2  student2      66
5  exam2  student3      68
6  exam3  student1      81
7  exam3  student2      80
8  exam3  student3      98

In [293]:
df.groupby('Students').mean()

             Scores
Students
student1  81.333333
student2  79.333333
student3  88.666667

In [294]:
df.groupby('Exams').max()['Scores']

Exams
exam1    100
exam2     68
exam3     98
Name: Scores, dtype: int32

In [295]:
df.groupby('Exams').describe()

      Scores
       count       mean        std   min   25%   50%   75%    max
Exams
exam1    3.0  95.666667   4.041452  92.0  93.5  95.0  97.5  100.0
exam2    3.0  67.333333   1.154701  66.0  67.0  68.0  68.0   68.0
exam3    3.0  86.333333  10.115994  80.0  80.5  81.0  89.5   98.0

In [296]:
df.groupby('Students').describe().transpose()

Students       student1   student2    student3
Scores count   3.000000   3.000000    3.000000
       mean   81.333333  79.333333   88.666667
       std    13.503086  13.012814   17.925773
       min    68.000000  66.000000   68.000000
       25%    74.500000  73.000000   83.000000
       50%    81.000000  80.000000   98.000000
       75%    88.000000  86.000000   99.000000
       max    95.000000  92.000000  100.000000